<?php $title = "My Personal Blog - Home"?>
<?php include('./headerfooter/header.php'); ?>
<div class="container">	
	<div class="posts">
		<?php 
		$posts = array(
			array(
				'title' => 'ঘুর্নিঝড় ফনি',
				'image' => './images/Screenshot 2023-04-04 at 10.56.58 PM.png',
				'excerpt' => 'ফনির চেহারা দেখে অফিস আজকে তাড়াতাড়িই ছুটি দিয়ে দিল। রাস্তায় নেমে দেখি টুপ টাপ বৃষ্টি পড়ছে। কাছে ছাতা আছে। সুতরাং ভয় নেই। ওভারব্রীজ দিয়ে রাস্তা পার হয়ে হাটা শুরু করব। তখন ছাতা ফোটানো যাবে। 
                    .
                    ঢাকা শহরের ওভারব্রীজেও হাইওয়ে গুলোর মত জ্যাম লেগে থাকে। ঠেলে ঠেলে ব্রিজে উঠার সময় খেয়াল করলাম একজন মহিলা একহাতে একটা মিডিয়াম সাইজের ব্যাগ আর অন্য হাত দিয়ে উনার বাচ্চাকে ধরে ব্রিজে উঠছেন। একটা সিড়ি করে উঠছেন, একটু করে থামছেন। বোঝাই যাচ্ছে ব্যাগটার ভালই ওজন। উনাকে বললাম, " আন্টি, ব্যাগটা আমি নিই? "। জিজ্ঞেস করতে একটু ভয় লাগল, চোর ভেবে না করে দিলে?কিন্তু এরকম হলো না। উনি হাসি মুখেই ব্যাগটা দিলেন আমার হাতে। যাক, পৃথিবীতে বিশ্বাস জিনিসটা এখনও বিলুপ্ত হয়ে যায় নি।
                    .
                    সাকছেসফুল্লি ওভারব্রিজ পার হয়ে রাস্তায় নামতেই ফনি তার রুপ দেখানো শুরু করে দিল। ছাতাটা ফুটিয়ে এমন ভাবে ধরলাম যাতে বাচ্চাটা না ভিজে। প্রচন্ড বাতাস আর বৃষ্টিতে ছাতাটা ধরে রাখা খুবই মুশলিক হয়ে যাচ্ছে। আন্টিকে জিজ্ঞেস করলাম যে উনি কোথায় যাবেন। উনি বললেন যে, একটা দোকানের নিচে আপাতত দাড়ালেই হবে, বৃষ্টি থামলে সি এন জি নিব। এখানে কোন দোকান নাই। একটু হেটে রেললাইন ক্রস করে উনাদের একটা দোকানের নিচে পৌছে দিলাম।সেখানে অনেকেই দাঁড়িয়ে আছে। উনিও একটা পজিশন নিয়ে দাঁড়িয়ে গেলেন। ব্যাগটা আমি উনার পাশে রেখে দিয়ে বললাম, " আন্টি আমি তাহলে যাই!"।
                    .
                    উরা ধুরা বাতাস আর বৃষ্টির মধ্য দিয়ে বাসার দিকে হেটে যাচ্ছি। মাথায় ছাতা নেই। দেবার মানেও হয় হয় না। কাকভেজা ভিজে গেছি। একবার ছাতা মাথায় দিয়ে দেখেছিলাম, কাকভেজা শরির এর উপর ছাতাটা বেমানান লাগছে জন্য ছাতা বন্ধ করে হাতে নিয়ে হাটছি আর ভাবছি, "পৃথিবীতে মনে হয় কৃতজ্ঞতা বিলুপ্তির পথে"। ফ্লাইওভারের নিচ থেকে একটা পাগল আমাকে বেশ উতসাহ নিয়ে দেখছে। মেইবি আমাকে উনার কাছে খুব ইন্টারেস্টিং মনে হচ্ছে!',
				'url' => 'singlePostPage.php?'
			),
			array(
				'title' => 'FIFA 2023',
				'image' => './images/Screenshot 2023-04-04 at 11.08.19 PM.png',
				'excerpt' => 'প্রতিটা লেজেন্ড এই বিশ্বকাপটা অন্তত একবার হলে ডিজার্ভ করে । অবশেষে দীর্ঘ অপেক্ষার অবসান । কনগ্রেচুলেশন্স টীম আর্জেন্টিনা ফর দা থার্ড স্টার ।  আর পেনাল্টি নিয়ে যাদের কমপ্লেইন আছে তাদের বলি, দিন শেষে জয় টাই আসল , যারা জিতে তারাই নায়ক, তাদের হাতেই লিখা হয় ইতিহাস। কে কিভাবে জিতছে এইটা ম্যাটার করে না । সো ফার,  শেষ বিশ্বকাপ হিসেবে মেসির হাতে বিশ্বকাপটা এখন পরিপূর্ন । 🇦🇷❤️',
				'url' => 'singlePostPage.php?'
			),
			array(
				'title' => 'Lord of the rings : The rings of power',
				'image' => './images/Screenshot 2023-04-04 at 11.04.38 PM.png',
				'excerpt' => 'Lord of the rings : The rings of power
                    আরও একটি প্রিকুয়্যাল । টিভি সিরিজ হিসেবে অসাধারণ একটি স্টার্ট । অবশ্য স্টোরি প্রোগ্রেস স্লো হওয়াতে অবাক হয় নি , কারণ Lord of the rings মুভিতেও এর স্টোরি টা এরকম ই স্লো আর লম্বা । অনেক ধৈর্যর ব্যাপার । সেই হিসেবে সামনে এই টিভি সিরিজ অনেক লম্বা আর গল্পটাও অনেক জাঁকজমক হবে ।  
                    Personal rating : 7/10
                    IMDb rating : 6.9/10',
				'url' => 'singlePostPage.php?'
            )
            );
        foreach ($posts as $post) {
            echo '<main>';
                echo '<section class="featured-post">';
                    echo '<div class="post-image">';
                        echo '<img src="'. $post['image'] . '" alt="' . $post['title'] . '">';
                    echo '</div>';
                    echo '<div class="post-excerpt">';
                        echo '<h3>'. $post['title'] .'</h3>';
                        echo '<p>'.substr($post['excerpt'], 0, 100).'...</p>';
                        echo '<a href="singlePostPage.php?title=' . urlencode($post['title']) . '&image=' . urlencode($post['image']) . '&excerpt=' . urlencode($post['excerpt']) . '">Read More</a>';
                    echo '</div>';
                echo '</section>';
            echo '</main>';
		}
        ?>
    </div>
    <div class="sidebar">
		<form class="search-form">
			<input type="text" name="search" placeholder="Search">
			<button type="submit">Go</button>
		</form>
		<ul style="text-align: center; list-style:none">
			<li><b><u>Catagories</u></b></li>
			<li><a href="#">Motivation</a></li>
			<li><a href="#">Happy</a></li>
			<li><a href="#">Love</a></li>
			<li><a href="#">Story</a></li>
		</ul>
	</div>
<?php include('./headerfooter/footer.php'); ?>