<?php $title = "My Personal Blog - Home"?>
<?php include('./headerfooter/header.php'); ?>
<main>
	<section class="featured-post">
		<h2>Featured Post</h2>
		<div class="post-image">
			<img src="./images/Screenshot 2023-04-04 at 10.56.58 PM.png" alt="Featured Post Image">
		</div>
		<div class="post-excerpt">
			<h3>ঘুর্নিঝড় ফনি</h3>
			<p>ফনির চেহারা দেখে অফিস আজকে তাড়াতাড়িই ছুটি দিয়ে দিল। রাস্তায় নেমে দেখি টুপ টাপ বৃষ্টি পড়ছে। কাছে ছাতা আছে। সুতরাং ভয় নেই। ওভারব্রীজ দিয়ে রাস্তা পার হয়ে হাটা শুরু করব। তখন ছাতা ফোটানো যাবে। 
			.
			ঢাকা শহরের ওভারব্রীজেও হাইওয়ে গুলোর মত জ্যাম লেগে থাকে। ঠেলে ঠেলে ব্রিজে উঠার সময় খেয়াল করলাম একজন মহিলা একহাতে একটা মিডিয়াম সাইজের ব্যাগ আর অন্য হাত দিয়ে উনার বাচ্চাকে ধরে ব্রিজে উঠছেন। একটা সিড়ি করে উঠছেন, একটু করে থামছেন। বোঝাই যাচ্ছে ব্যাগটার ভালই ওজন। উনাকে বললাম, " আন্টি, ব্যাগটা আমি নিই? "। জিজ্ঞেস করতে একটু ভয় লাগল, চোর ভেবে না করে দিলে?কিন্তু এরকম হলো না। উনি হাসি মুখেই ব্যাগটা দিলেন আমার হাতে। যাক, পৃথিবীতে বিশ্বাস জিনিসটা এখনও বিলুপ্ত হয়ে যায় নি।
			.
			সাকছেসফুল্লি ওভারব্রিজ পার হয়ে রাস্তায় নামতেই ফনি তার রুপ দেখানো শুরু করে দিল। ছাতাটা ফুটিয়ে এমন ভাবে ধরলাম যাতে বাচ্চাটা না ভিজে। প্রচন্ড বাতাস আর বৃষ্টিতে ছাতাটা ধরে রাখা খুবই মুশলিক হয়ে যাচ্ছে। আন্টিকে জিজ্ঞেস করলাম যে উনি কোথায় যাবেন। উনি বললেন যে, একটা দোকানের নিচে আপাতত দাড়ালেই হবে, বৃষ্টি থামলে সি এন জি নিব। এখানে কোন দোকান নাই। একটু হেটে রেললাইন ক্রস করে উনাদের একটা দোকানের নিচে পৌছে দিলাম।সেখানে অনেকেই দাঁড়িয়ে আছে। উনিও একটা পজিশন নিয়ে দাঁড়িয়ে গেলেন। ব্যাগটা আমি উনার পাশে রেখে দিয়ে বললাম, " আন্টি আমি তাহলে যাই!"।
			.
			উরা ধুরা বাতাস আর বৃষ্টির মধ্য দিয়ে বাসার দিকে হেটে যাচ্ছি। মাথায় ছাতা নেই। দেবার মানেও হয় হয় না। কাকভেজা ভিজে গেছি। একবার ছাতা মাথায় দিয়ে দেখেছিলাম, কাকভেজা শরির এর উপর ছাতাটা বেমানান লাগছে জন্য ছাতা বন্ধ করে হাতে নিয়ে হাটছি আর ভাবছি, "পৃথিবীতে মনে হয় কৃতজ্ঞতা বিলুপ্তির পথে"। ফ্লাইওভারের নিচ থেকে একটা পাগল আমাকে বেশ উতসাহ নিয়ে দেখছে। মেইবি আমাকে উনার কাছে খুব ইন্টারেস্টিং মনে হচ্ছে!</p>
		</div>
	</section>
</main>
<?php include('./headerfooter/footer.php'); ?>